ma-hy15/nrf52832_ble_nus/main.c
//		err_code = nrf_queue_pop(&m_buf_queue, &m_buf);
//		APP_ERROR_CHECK(err_code);		
//		length = m_buf.length;
//					
//		err_code = ble_nus_data_send(&m_nus, m_buf.p_data, &length, m_conn_handle);
//		//NRF_LOG_INFO("Data: %d", m_buf.p_data[0]);
//		if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
//				 (err_code != NRF_ERROR_NOT_FOUND) )
//		{
//				APP_ERROR_CHECK(err_code);
//		}
//		if (err_code == NRF_SUCCESS)
//		{
//			m_len_sent += length;
//			retry = false;
//		}
//		else
//		{
//			retry = true;
//			break;
//		}
//	}			
//}

//static void throughput_timer_handler(void * p_context)
//{
//#ifndef APP_QUEUE	
//	//the snippet used to test data throughput only. no queue is involved
//	ret_code_t err_code;
//	uint16_t length;
//	m_cnt_7ms++;	
//	//sending code lines
//	length = m_ble_nus_max_data_len;	
//	do
//	{					
//		err_code = ble_nus_data_send(&m_nus, m_data_array, &length, m_conn_handle);
//		if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
//				 (err_code != NRF_ERROR_NOT_FOUND) )
//		{
//				APP_ERROR_CHECK(err_code);
//		}
//		if (err_code == NRF_SUCCESS)
//		{
//			m_len_sent += length; 	
//			m_data_array[0]++;
//			m_data_array[length-1]++;	
//		}
//	} while (err_code == NRF_SUCCESS);

//	//calculate speed every 1 second
//	if (m_cnt_7ms == 143)
//	{
//		NRF_LOG_INFO("==**Speed: %d B/s**==", m_len_sent);
//		m_cnt_7ms = 0;
//		m_len_sent = 0;
//		m_data_array[0] = 0;
//		m_data_array[length-1] = 0;
//	}	
//	//NRF_LOG_INFO("PacketNo.: %d == Time: %d *7ms", m_data_array[0], m_cnt_7ms);	
//#else
//	//the snippet simulate a real application scenairo. Queue is involved.
//	ret_code_t err_code1, err_code2;	
//	buffer_t buf;
//	static uint8_t val = 0;
//	//produce the data irregard of BLE activity
//	m_data_array[(m_cnt_7ms%10)*420] = val++;
//	m_data_array[(m_cnt_7ms%10)*420+210] = val++;
//	
//	//put the data into a queue to cache them
//	buf.p_data = &m_data_array[(m_cnt_7ms%10)*420];
//	buf.length = MIN(m_ble_nus_max_data_len,210);
//	err_code1 = nrf_queue_push(&m_buf_queue, &buf);
//	//APP_ERROR_CHECK(err_code1); //it may return NRF_ERROR_NO_MEM. we skip this error
//	
//	buf.p_data = &m_data_array[(m_cnt_7ms%10)*420+210];
//	buf.length = MIN(m_ble_nus_max_data_len,210);
//	err_code2 = nrf_queue_push(&m_buf_queue, &buf);
//	//APP_ERROR_CHECK(err_code2);	//it may return NRF_ERROR_NO_MEM. we skip this error
//	
//	ble_data_send_with_queue();
//	
//	if(err_code1 == NRF_ERROR_NO_MEM || err_code2 == NRF_ERROR_NO_MEM)
//	{
//		NRF_LOG_INFO("Drop");	
//	}
//	
//	m_cnt_7ms++;	
//	//calculate speed every 1 second
//	if (m_cnt_7ms == 143)
//	{
//		NRF_LOG_INFO("==**Speed: %d B/s**==", m_len_sent);
//		m_cnt_7ms = 0;
//		m_len_sent = 0;
//	}	
//	//NRF_LOG_INFO("Time: %d *7ms", m_cnt_7ms);		
//	
//#endif	
//}


//void throughput_test()
//{
//	ret_code_t err_code;
//	err_code = app_timer_create(&m_timer_speed, APP_TIMER_MODE_REPEATED, throughput_timer_handler);
//	APP_ERROR_CHECK(err_code);

//#if 0
//	  ble_opt_t  opt;
//    memset(&opt, 0x00, sizeof(opt));
//    opt.common_opt.conn_evt_ext.enable = true;
//    err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
//    APP_ERROR_CHECK(err_code);
//#endif	
//	
//}

static void wdt_timer_handler(void * p_context)
{
	static uint8_t wdt_sec=0;
	wdt_sec++;
	nrfx_wdt_channel_feed(my_channel_id);
	nrf_gpio_pin_toggle(TPL5010_DONE);
	//NRF_LOG_INFO("FEED DOG:%d",wdt_sec);
}

//static void advertising_timer_handler(void * p_context)
//{
//	// 创造一个间隔发广播的中断函数
//	NRF_LOG_INFO("ADVERTISING START");
//	advertising_start();
//}

void app_timer_config()
{
		ret_code_t err_code;
	  err_code = app_timer_create(&wdt_timer_speed, APP_TIMER_MODE_REPEATED, wdt_timer_handler);
	  APP_ERROR_CHECK(err_code);
		APP_ERROR_CHECK(app_timer_start(wdt_timer_speed, APP_TIMER_TICKS(1000),NULL));
//	err_code = app_timer_create(&advertising_timer, APP_TIMER_MODE_REPEATED, advertising_timer_handler);
//	APP_ERROR_CHECK(err_code);
//	APP_ERROR_CHECK(app_timer_start(wdt_timer_speed, APP_TIMER_TICKS(30000),NULL));
}

//定时器事件回调函数
void my_timer_event_handler(nrf_timer_event_t event_type,void* p_context)
{
	switch(event_type)
	{
		case NRF_TIMER_EVENT_COMPARE0:
			nrf_gpio_pin_toggle(LED_3);
			break;
		default:
			break;
	}
}
//定时器配置函数
void timer_config()
{
	uint32_t err_code=NRF_SUCCESS;
	//uint32_t time_ms=1;
	uint32_t time_us=500;
	uint32_t ticks;

	nrfx_timer_config_t my_timer_config = NRFX_TIMER_DEFAULT_CONFIG; // 先使用默认配置，然后更改
	my_timer_config.frequency = NRF_TIMER_FREQ_1MHz; // 在头文件nrf_timer.h中
	err_code=nrfx_timer_init(&MY_TIMER,&my_timer_config,my_timer_event_handler); //无论什么模式，都要给出事件回调函数，即使用不到，也要定义
	APP_ERROR_CHECK(err_code);
	
	//ticks=nrfx_timer_ms_to_ticks(&MY_TIMER,time_ms);
	ticks=nrfx_timer_us_to_ticks(&MY_TIMER,time_us);
	nrfx_timer_extended_compare(&MY_TIMER,NRF_TIMER_CC_CHANNEL0,ticks,NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK,false); //最后一项是中断，不开启中断，则没有事件回调
	
	//nrfx_timer_enable(&MY_TIMER);
}

void ave(uint16_t* buffer)
{
	uint32_t tmp1=0;
	uint32_t tmp2=0;
	uint32_t tmp3=0;
	uint32_t tmp4=0;
	for(int i=0;i<SAMPLE_BUFFER_DOTS;i++)
	{
		tmp1 += buffer[i*4];
		tmp2 += buffer[i*4+1];
		tmp3 += buffer[i*4+2];
		tmp4 += buffer[i*4+3];
	}
	ave_data[hc_num][0] =tmp1/SAMPLE_BUFFER_DOTS;
	ave_data[hc_num][1] =tmp2/SAMPLE_BUFFER_DOTS;
	ave_data[hc_num][2] =tmp3/SAMPLE_BUFFER_DOTS;
	ave_data[hc_num][3] =tmp4/SAMPLE_BUFFER_DOTS;
	if(hc_num < HC)
		hc_num++;
	else
		hc_num=0;
}

void rms(uint16_t* buffer)
{
	uint32_t tmp1=0;
	uint32_t tmp2=0;
	uint32_t tmp3=0;
	uint32_t tmp4=0;
	for(int i=0;i<SAMPLE_BUFFER_DOTS;i++)
	{
		tmp1 += ((uint32_t)buffer[i*4])*((uint32_t)buffer[i*4]);
		tmp2 += ((uint32_t)buffer[i*4+1])*((uint32_t)buffer[i*4+1]);
		tmp3 += ((uint32_t)buffer[i*4+2])*((uint32_t)buffer[i*4+2]);
		tmp4 += ((uint32_t)buffer[i*4+3])*((uint32_t)buffer[i*4+3]);
	}
	// 或者直接取平方均值的9-24位（4096=2^12）(计算得500以下的有效值也才相差0.2)
	tmp1 = tmp1/SAMPLE_BUFFER_DOTS;
	tmp1 = tmp1>>8;
	tmp2 = tmp2/SAMPLE_BUFFER_DOTS;
	tmp2 = tmp2>>8;
	tmp3 = tmp3/SAMPLE_BUFFER_DOTS;
	tmp3 = tmp3>>8;
	tmp4 = tmp4/SAMPLE_BUFFER_DOTS;
	tmp4 = tmp4>>8;
	ave_data[hc_num][0] =(uint16_t)tmp1;
	ave_data[hc_num][1] =(uint16_t)tmp2;
	ave_data[hc_num][2] =(uint16_t)tmp3;
	ave_data[hc_num][3] =(uint16_t)tmp4;
//	double temp1 =tmp1/SAMPLE_BUFFER_DOTS;
//	double temp2 =tmp2/SAMPLE_BUFFER_DOTS;
//	double temp3 =tmp3/SAMPLE_BUFFER_DOTS;
//	double temp4 =tmp4/SAMPLE_BUFFER_DOTS;
//	ave_data[hc_num][0] =(uint16_t)((int)(sqrt(temp1)));
//	ave_data[hc_num][1] =(uint16_t)((int)(sqrt(temp2)));
//	ave_data[hc_num][2] =(uint16_t)((int)(sqrt(temp3)));
//	ave_data[hc_num][3] =(uint16_t)((int)(sqrt(temp4)));
	if(hc_num < HC)
		hc_num++;
	else
		hc_num=0;
}

void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
	ret_code_t err_code=NRF_SUCCESS;
	
	if(p_event->type==NRFX_SAADC_EVT_DONE)
	{
		//设置缓存，为下一次采样准备，具体我也不懂
		APP_ERROR_CHECK(nrfx_saadc_buffer_convert(p_event->data.done.p_buffer,SAMPLE_BUFFER_LEN));
		
